
// Common
"OK" = "OK";
"Cancel" = "Peru";
"Error" = "Virhe";
"byte" = "byte";
"bytes" = "bytes";

// Application
"Quit" = "Lopeta";
"Don't Quit" = "Älä lopeta";
"Are you sure you want to quit? Daybreak is currently downloading files. If you quit now, it will not finish downloading these files." = "Haluatko varmasti lopettaa? Daybreak lataa tiedostoja. Jos lopetat, lataus keskeytetään";
"Daybreak Feedback" = "Daybreakn palaute";
"Are you sure you want to empty the cache?" = "Haluatko varmasti tyhjentää välimuistin?";
"Daybreak saves the contents of webpages you open, and stores them in a cache, so the pages load faster when you visit them again." = "Daybreak tallentaa avattujen sivujen sisällön välimuistiin, jotta sivut latautuvat nopeammin, kun vierailet niillä uudestaan.";
"Empty" = "Tyhjennä";
"On disk" = "On disk";
"In memory" = "In memory";

// Menu titles
"About Daybreak" = "Tietoja Daybreaksta";
"Provide Feedback" = "Anna palautetta";
"Check for Updates…" = "Tarkista päivitykset…";
"Preferences…" = "Asetukset…";
"Empty Cache…" = "Tyhjennä välimuisti…";
"Services" = "Palvelut";
"Hide Daybreak" = "Kätke Daybreak";
"Hide Others" = "Kätke muut";
"Show All" = "Näytä kaikki";
"Quit Daybreak" = "Lopeta Daybreak";
"File" = "Tiedosto";
"New Window" = "Uusi ikkuna";
"New Tab" = "Uusi välilehti";
"Open…" = "Avaa…";
"Open Location…" = "Avaa sijainti…";
"Close" = "Sulje";
"Save As…" = "Tallenna nimellä...";
"Download from URL…" = "Lataa osoitteesta…";
"Print…" = "Tulosta…";
"Edit" = "Muokkaa";
"Undo" = "Peru";
"Redo" = "Tee uudelleen";
"Cut" = "Leikkaa";
"Copy" = "Kopioi";
"Paste" = "Liitä";
"Delete" = "Poista";
"Select All" = "Valitse kaikki";
"Find" = "Etsi";
"Find…" = "Etsi…";
"Find Next" = "Etsi seuraava";
"Find Previous" = "Etsi edellinen";
"Use Selection for Find" = "Käytä valintaa etsimiseen";
"Jump to Selection" = "Siirry valittuun kohteeseen";
"Spelling and Grammar" = "Tavutus ja oikeinkirjoitus";
"Show Spelling…" = "Näytä tavutus…";
"Check Spelling" = "Tarkista oikeinkirjoitus";
"Check Spelling While Typing" = "Tarkista tavutus kirjoitettaessa";
"Check Grammar With Spelling" = "Tarkista oikeinkirjoitus kirjoitettaessa";
"Substitutions" = "Korvaaminen";
"Smart Copy/Paste" = "Älykäs kopioiminen/liittäminen";
"Smart Quotes" = "Typografiset lainausmerkit";
"Smart Links" = "Älykkäät linkit";
"Speech" = "Puhe";
"Start Speaking" = "Aloita puhuminen";
"Stop Speaking" = "Lopeta puhuminen";
"View" = "Näytä";
"Show All Bars" = "Näytä kaikki palkit";
"Hide All Bars" = "Kätke kaikki palkit";
"Show Toolbar" = "Näytä työkalupalkki";
"Hide Toolbar" = "Kätke työkalupalkki";
"Show Tabbar" = "Näytä välilehtipalkki";
"Hide Tabbar" = "Kätke välilehtipalkki";
"Sidebar Position" = "Sivupalkin sijainti";
"Left" = "Vasemmallla";
"Right" = "Oikealla";
"Customize Toolbar…" = "Muokkaa työkalupalkkia…";
"Reload" = "Lataa uudelleen";
"Stop" = "Pysäytä";
"View Scale" = "Mittakaava";
"Text Scale" = "Tekstin koko";
"Actual Size" = "Normaali koko";
"Zoom In" = "Suurenna";
"Zoom Out" = "Pienennä";
"Select User Agent" = "Valitse asiakasohjelma";
"Show Source" = "Näytä lähdekoodi";
"Hide Source" = "Piilota lähdekoodi";
"Show Web Inspector" = "Näytä verkontarkastelutyökalu (Web inspector)";
"Show Error Console" = "Näytä virhekonsoli";
"History" = "Sivuhistoria";
"Back" = "Takaisin";
"Forward" = "Eteenpäin";
"Bookmarks" = "Kirjanmerkit";
"Show History…" = "Näytä sivuhistoria…";
"Show All Bookmarks" = "Näytä kaikki kirjanmerkit";
"Hide All Bookmarks" = "Kätke kaikki kirjanmerkit";
"Add Bookmark…" = "Lisää kirjanmerkki…";
"Find in Bookmarks" = "Etsi kirjanmerkeistä";
"as List" = "luettelona";
"as Icons" = "kuvakkeina";
"as Tiles" = "as Tiles";
"Window" = "Ikkuna";
"Minimize" = "Kutista";
"Zoom" = "Suurenna";
"Select Next Tab" = "Valitse seuraava välilehti";
"Select Previous Tab" = "Valitse edellinen välilehti";
"Downloads" = "Lataukset";
"Bring All to Front" = "Tuo kaikki etualalle";
"Help" = "Ohje";
"Daybreak Help" = "Daybreakn ohje";
"Localize…" = "Käännä paikalliselle kielelle…";
"Installed Plug-ins" = "Asennetut liitännäiset";
"Daybreak Home Page" = "Daybreakn kotisivu";
"Search in Google" = "Etsi Googlesta";
"Open Google Search Results in New Tab" = "Avaa Googlen hakutulokset uudella välilehdellä";
"Open in Application..." = "Open in Application...";
"Open in %@" = "Open in %@";
"Open Link in New Tab" = "Avaa linkki uudella välilehdellä";
"Open Link in Application..." = "Open Link in Application...";
"Open Link in %@" = "Open Link in %@";
"Open Frame in Current Frame" = "Avaa kehys nykyisellä kehyksellä";
"Open Frame in New Tab" = "Avaa kehys uudella välilehdellä";

// Preferences
"General" = "Yleiset";
"Open new windows with home page" = "Avaa uudet ikkunat kotisivulla";
"Open new tabs with home page" = "Avaa uudet välilehdet kotisivulla";
"Home page" = "Kotisivu";
"Save downloaded files to" = "Tallenna ladatut tiedostot kohteeseen";
"Open URL from applications" = "Avaa sovellusten osoite";
"in a new window" = "uudessa ikkunassa";
"in a new tab" = "uudella välilehdellä";
"in the current tab" = "nykyisellä välilehdellä";
"Quit when the last window is closed" = "Lopeta, kun viimeinen ikkuna on suljettu";
"Confirm before closing multiple tabs" = "Vahvista ennen useiden välilehtien sulkemista";
"Check the new version after launching" = "Etsi päivitetty versio käynnistettäessä";
"Clears all caches after launching" = "Tyhjennä kaikki välimuistitiedot käynnistettäessä";
"Appearance" = "Ulkoasu";
"Allows animated image to loop" = "Salli animoidun kuvan liikkua";
"Allows animated images" = "Salli animoidut kuvat";
"Loads images automatically" = "Lataa kuvat automaattisesti";
"Default encoding" = "Oletuskoodaus";
"Include backgrounds when printing" = "Sisällytä taustat tulostettaessa";
"Show bookmarks when window opens" = "Näytä kirjanmerkit, kun ikkuna avataan";
"Show alert when removing bookmark" = "Näytä varoitus poistettaessa kirjanmerkkejä";
"Security" = "Turvallisuus";
"Enable plug-ins" = "Salli liitännäiset";
"Enable Java" = "Salli java";
"Enable JavaScript" = "Salli javascript";
"Block pop-up windows" = "Estä ponnahdusikkunat";
"URL field shows IDN as ASCII" = "Osoitekenttä näyttää IDN:n ASCII:na";
"Accept cookies" = "Hyväksy evästeet";
"Save history for" = "Tallenna sivuhistoria ajalta";
"Advanced" = "Edistyneet asetukset";
"Enable Web Inspector" = "Salli verkontarkastelutyökalu (Web Inspector)";
"When a new tab opens, make it active" = "Näytä uusi välilehti, kun se avataan";

// Bookmark
"Untitled" = "Otsikoimaton";
"Title" = "Otsikko";
"URL" = "Osoite";
"Label" = "Etiketti";
"Add" = "Lisää";
"Open an item" = "Avaa kohde";
"Open %d items" = "Avaa %d kohteet";
"Remove an item" = "Poista kohde";
"Remove %d items" = "Poista %d kohteet";

// Tab
"Close Others" = "Sulje muut";

// Document
"Go" = "Siirry";
"Search" = "Etsi";
"Suggestions" = "Suggestions";
"URL Field" = "Osoitekenttä";
"Add Bookmark" = "Lisää kirjanmerkki";
"Snapshot" = "Kuvakaappaus";
"Snapshot Current Page" = "Kaappaa nykyinen sivu";
"Go Home" = "Siirry kotiin";
"Go Home Page" = "Siirry kotisivulle";
"Bug Report" = "Virheraportti";
"User Agent" = "Asiakasohjelma";
"Source" = "Lähdekoodi";
"Save" = "Tallenna";
"Scale" = "Mittakaava";
"Send Bug Report" = "Lähetä virheraportti";
"Load" = "Lataa";
"Reload / Stop" = "Lataa uudelleen/ pysäytä";
"Text Encoding" = "Tekstin koodaus";
"Default" = "Default";
"Open in other application…" = "Avaa toisessa sovelluksessa…";
"This page is already added to bookmarks. \nAre you sure you want to update it?" = "Kirjanmerkki on jo olemassa. \nHaluatko varmasti päivittää sen?";
"Are you sure you want to bookmark this page?" = "Haluatko varmasti liittää tämän sivun kirjanmerkkeihin?";
"Download any file from typed URL." = "Lataa jokainen tiedosto osoitteesta.";
"Are you sure you want to open %d items?" = "Haluatko varmasti avata %d kohteet?";
"Complete to add new localization. Restart Daybreak." = "Viimeistele uusi käännös käynnistämällä  Daybreak uudelleen.";
"Failed to add new localization." = "Uuden käännöksen lisääminen epäonnistui.";

// Update
"A new version of Daybreak %@ is available." = "Uusi versio Daybreaksta %@ on saatavilla.";
"Daybreak %@ is currently the newest version available." = "Daybreak %@ on jo uusin versio.";
"Could not check for updates." = "Päivityksiä ei löytynyt.";
"If you click the \"Download\" button, the download of the disk image file will begin. " = "Jos painat \"Tallenna\" nappia, kuvakkeen sisältämän tiedoston  lataaminen alkaa. ";
"Not Now" = "Ei nyt";
"Skip This Version" = "Ohita tämä versio";
"Download" = "Tallenna";

// Snapshot
"Only visible portion" = "Vain näkyvissä oleva alue";
"Update" = "Päivitä";
"Size" = "Koko";
"File Type" = "Tiedostotyyppi";
"File Size" = "Tiedoston koko";
"Updating..." = "Päivittää...";
"Compression" = "Pakkaaminen";
"Quality" = "Laatu";

// Bug report
"Send Bug Report" = "Lähetä virheraportti";
"Summary" = "Yhteenveto";
"Reproducibility" = "Virheen ilmeneminen";
"Describe" = "Kuvaus";
"None" = "Ei mitään";
"A way to reproduce" = "Ilmenemistapa";
"Could not send the report." = "Raporttia ei voitu lähettää.";
"OS" = "Käyttöjärjestelmä";
"Processor" = "Prosessori";
"Application Version" = "Sovelluksen versio";
"Daybreak Bug Report" = "Daybreakn virheraportti";

// User Agent
"Other" = "Muu";

// History
"Remove" = "Poista";
"Remove All" = "Poista kaikki";
"Are you sure you want to remove all items?" = "Haluatko varmasti poistaa kaikki kohteet?";

// Findbar
"Ignore Case" = "Älä huomioi";
"Wrap Around" = "Käännä ympäri";

// Download
"Undone" = "Kesken";
"Done" = "Valmis";

// Localization
"Localize" = "Käännös";
"Language" = "Kieli";
"Create" = "Luo";

// Error titles
"Unknown Error" = "Tuntematon virhe";
"Cancelled" = "Peruutettu";
"Bad URL" = "Virheellinen osoite";
"Timed Out" = "Aikakatkaisu";
"Unsupported URL" = "Osoitetta ei tueta";
"Cannot Find Host" = "Verkkopalvelua ei löytynyt";
"Cannot Connect to Host" = "Verkkopalveluun ei voitu yhdistää";
"Network Connection Lost" = "Nettiyhteys puuttuu";
"DNS Lookup Failed" = "DNS-haku epäonnistui";
"Too Many Redirects" = "Liian monta uudelleenohjausta";
"Resource Unavailable" = "Ei käytettävissä";
"Not Connected to Internet" = "Ei yhteydessä internetiin";
"Redirect to Non Existent Location" = "Uudelleenohjaus osoitteeseen, jota ei ole";
"Bad Server Response" = "Virheellinen vastaus palvelimelta";
"User Cancelled Authentication" = "Käyttäjä perui todentamisen";
"User Authentication Required" = "Käyttäjän todentamista vaaditaan";
"Zero Byte Resource" = "Nolla tavua-virhe";
"Cannot Decode Raw Data" = "Lähdedataa ei voitu avata";
"Cannot Decode Content Data" = "Sisällön dataa ei voitu avata";
"Cannot Parse Response" = "Vastausta ei voitu jäsentää";
"File Does Not Exist" = "Tiedostoa ei ole";
"File is Directory" = "Tiedosto on hakemisto";
"No Permissions to ReadFile" = "Ei oikeutta lukea tiedostoa";
"Data Length Exceeds Maximum" = "Datan pituus ylittää enimmäismäärän";
"Secure Connection Failed" = "Suojattu yhteys epäonnistui";
"Server Certificate Has BadDate" = "Palvelimen varmenne on vanhentunut";
"Server Certificate Untrusted" = "Palvelimen varmenne ei ole luotettu";
"Continue" = "Continue";
"The certificate for this website is invalid. You might be connecting to a website that is pretending to be \"%@\", which could put your confidential information at risk. Would you like to connect to the website anyway?" = "The certificate for this website is invalid. You might be connecting to a website that is pretending to be \"%@\", which could put your confidential information at risk. Would you like to connect to the website anyway?";
"Server Certificate Has UnknownRoot" = "Palvelimen varmenteella on tuntematon pääkäyttäjä";
"Server Certificate Not Yet Valid" = "Palvelimen varmenne ei ole vielä voimassa";
"Client Certificate Rejected" = "Asiakkaan varmenne hylättiin";
"Cannot Load from Network" = "Ei voidu ladata netistä";
"Daybreak can’t open the page “%@”" = "Daybreak ei voi avata sivua “%@”";
"Could not open in %@." = "Ei voitu avata %@ :ssa.";
